{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/home/dzigen/Desktop/PersonalAI/pai_venv/lib/python3.10/site-packages/tqdm/auto.py:21: TqdmWarning: IProgress not found. Please update jupyter and ipywidgets. See https://ipywidgets.readthedocs.io/en/stable/user_install.html\n",
      "  from .autonotebook import tqdm as notebook_tqdm\n"
     ]
    }
   ],
   "source": [
    "import pickle\n",
    "from tqdm import tqdm\n",
    "import sys\n",
    "import hashlib\n",
    "\n",
    "# TO CHANGE\n",
    "BASEDIR = \"../\"\n",
    "# TO CHNAGE\n",
    "sys.path.insert(0, BASEDIR)\n",
    "\n",
    "from src.utils.data_structs import TripletCreator, NodeCreator, Relation, NODES_TYPES_MAP, RELATIONS_TYPES_MAP\n",
    "from src.db_drivers.graph_driver.connectors.Neo4jConnector import Neo4jConnector\n",
    "from src.db_drivers.graph_driver import GraphDBConnectionConfig\n",
    "NEO4J_URL =\"bolt://localhost:7687\"\n",
    "NEO4J_USER = \"neo4j\"\n",
    "NEO4J_PWD = \"password\"\n",
    "GRAPH_DB_NAME = 'DiaasqGigachat'"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "config = GraphDBConnectionConfig(uri=NEO4J_URL, params={'user': NEO4J_USER, 'pwd': NEO4J_PWD, 'db_name': GRAPH_DB_NAME})"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "graph_db = Neo4jConnector(config)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [],
   "source": [
    "def create_id(seed: str) -> str:\n",
    "    return hashlib.md5(seed.encode()).hexdigest()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "formated_triplets amount:  211542\n"
     ]
    }
   ],
   "source": [
    "raw_triplets = list(graph_db.execute_query(\"MATCH (n1)-[rel]->(n2) RETURN n1, rel, n2\"))\n",
    "formated_triplets = graph_db.parse_query_output(raw_triplets )\n",
    "print(\"formated_triplets amount: \", len(formated_triplets))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "100%|██████████| 211542/211542 [00:01<00:00, 195218.98it/s]\n"
     ]
    }
   ],
   "source": [
    "unique_nodes = dict()\n",
    "unique_relations = dict()\n",
    "for triplet in tqdm(formated_triplets):\n",
    "    sn_str_id = create_id(NodeCreator.stringify(triplet.start_node)[1])\n",
    "    en_str_id = create_id(NodeCreator.stringify(triplet.end_node)[1])\n",
    "    unique_nodes[sn_str_id] = triplet.start_node\n",
    "    unique_nodes[en_str_id] = triplet.end_node\n",
    "    unique_relations[triplet.relation.id] = triplet"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "54051 211542\n"
     ]
    }
   ],
   "source": [
    "print(len(unique_nodes), len(unique_relations))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "100%|██████████| 54051/54051 [47:26<00:00, 18.99it/s]  \n"
     ]
    }
   ],
   "source": [
    "for str_id, node in tqdm(unique_nodes.items()):\n",
    "    graph_db.execute_query(f'MATCH (n) WHERE elementId(n) = \"{node.id}\" SET n.str_id = \"{str_id}\";')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "100%|██████████| 211542/211542 [3:13:01<00:00, 18.26it/s]  \n"
     ]
    }
   ],
   "source": [
    "for rel_id, triplet in tqdm(unique_relations.items()):\n",
    "    graph_db.execute_query(f'MATCH (n1)-[rel]->(n2) WHERE elementId(n1) = \"{triplet.start_node.id}\" AND elementId(n2) = \"{triplet.end_node.id}\" AND elementId(rel) = \"{triplet.relation.id}\" SET rel.str_id = \"{triplet.id}\";')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "formated_triplets amount:  211542\n"
     ]
    }
   ],
   "source": [
    "raw_triplets = list(graph_db.execute_query(\"MATCH (n1)-[rel]->(n2) RETURN n1, rel, n2\"))\n",
    "formated_triplets = graph_db.parse_query_output(raw_triplets)\n",
    "print(\"formated_triplets amount: \", len(formated_triplets))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [],
   "source": [
    "with open(f'../../{GRAPH_DB_NAME}.pickle', 'wb') as f:\n",
    "    pickle.dump(formated_triplets, f)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "pai_venv",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.12"
  },
  "orig_nbformat": 4
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
